# Реализовать функцию int_func(), принимающую слова из маленьких латинских букв и возвращающую их же, но с прописной первой буквой.
# Например, print(int_func(‘text’)) -> Text.

# Продолжить работу над заданием. В программу должна попадать строка из слов, разделённых пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре.
# Нужно сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Используйте написанную ранее функцию int_func().

'''def int_func(text):
    return text.title()
print(int_func(input('Введите слово в нижнем регистре: ')))
'''


def int_func():
    for i in input('Введите латинские буквы в нижнем регистре: ').split():
        a = 0  # Количество совпадений в цикле for b in i:
        for b in i:
            if 97 <= ord(b) <= 122:
                a += 1
        if a == len(i):  # Если а совпадает с количеством длины i
            print(i.title())

int_func()